<template>
  <div class="scroll-page">
    <h1>よくある質問</h1>

    <p>よくある質問やされたい質問を掲載しています</p>
    <h3>Q. シケタイなんですが手伝うことありますか？</h3>
    <p>
      A.
      京大wikiは全学共通科目や専門科目の過去問を多数揃えていますので，ぜひ期末試験前にはクラスの人に京大wikiを紹介ください。
      京大wikiが全学に対して広報できる手段は少なく，学生間の口コミを頼りにしているのが現状です。
      <br> また，京大wikiはみなさんからの試験問題の提供で成り立っています。シケタイの方々は期末試験後にクラスの人から過去問を収集してまとめて提供したり，試験対策用に集めた昔の過去問をまとめて投げていただけると大変助かります。
    </p>

    <h3>Q. 何者でもないのですが，手伝うことはありますか？</h3>
    <p>A. 実はまだ公開できていない過去問がたくさんあり，運営ではどうにもならない状況なので整理を手伝って欲しいです。メールかDMをください</p>
    
    <h3>Q. 検索窓の使い方がよくわかりません</h3>
    <p>
      科目名，教員名，開講コマ，教員名などを入力してください．
      科目名の数字は半角アラビア数字に統一しています<br>
      例) 集合と位相，月3，理学部
    </p>

    <h3>Q. ログインに失敗します</h3>
    <p>メールアドレスのドメインは @st.kyoto-u.ac.jp，パスワードは8文字以上です。ご確認ください。</p>
    
    <h3>Q. こんな機能が欲しいです</h3>
    <p>GitHubのwiki-djangoのissuesに詳しく書き込んでください。
    </p>

    <h3>Q. 欲しい機能を追加してもいいですか？</h3>
    <p>ぜひどうぞ。だれでも欲しい機能が追加できるよう，京大wikiはGitHubにてソースコードを公開しています。プルリクお待ちしています</p>

    <h3>Q. 記事や科目名を見つけたのですが...</h3>
    <p>メールかDMでそっと教えてください</p>

    <h3>Q. バグっています</h3>
    <p>重大なバグの場合は早急にメールかDMをください。軽微なバグの場合はGitHubのwiki-djangoのissuesに書き込んでください
    </p>
    
    <h3>Q. 全学共通科目の過去問が見つかりません。どうしたらいいですか？</h3>
    <p>
      もし手に入ったら送ってください
    </p>

    <h3>Q. 専門科目の過去問が見つかりません。どうしたらいいですか？</h3>
    <p>
      法学部専門科目は <a href="https://kyoto0300.sub.jp" target="_blank" class="link-text">法学部学生自治会</a>が大量に保有していますので，お問い合わせください。<br>
      経済学部専門科目は，経済学部同窓会が公開しているそうです，経済学部の方に聞いてみてください。<br>
      文学部には過去問の文化がないと聞きますので，どこにも過去問の蓄積がなく探し当てるのは困難だと思われます。<br>
      農学部専門科目は <a href="https://kyodaiagri.org" target="_blank" class="link-text">農学部学生自治会</a> に問い合わせるか，あるいは上の学年に聞いてみると過去問が見つかるかもしれません。<br>
      医学部薬学部では毎年それなりにシケタイが活発に動いているようなので，上の学年に聞くと分かるかもしれません．<br>
      工学部の場合，物工は <a href="https://ku1025.netlify.app" target="_blank" class="link-text">KU1025</a>，電電は<a href="https://kuee.netlify.app" target="_blank" class="link-text">KU1025</a>に過去問が集まっています。<br>
      理学部専門科目は京大wikiになければ諦めていいと思います。
    </p>
    <h3>Q. 院試の過去問が見つかりません。どうしたらいいですか？</h3>
    <p>
      京大wikiでは院試の過去問は取り扱っていません。まずは出願先の研究科や専攻のHPを確認してみてください。また研究室の先輩に過去問を持っているか尋ねてみてください。
    </p>

    <h3>Q. 学外生なのですが，諸事情があり過去問を閲覧したいです</h3>
    <p>個別に対応しますので，メールかDMをください</p>
  </div>
</template>
<script>
export default {
  title: "回収済みリスト",
  auth: false
}
</script>