<template>
  <div class="scroll-page">
    <h1>よくある質問</h1>

    <p>よくある質問やされたい質問を掲載しています</p>
    <h3>シケタイなんですが</h3>
    <p>
      京大wikiとシケタイは直接の関わりはありませんが，
      期末試験前にはクラスラインで京大wikiを紹介したり，期末試験後にクラスの人から過去問を集めた送ったりしていただけるとととても助かります
    </p>
    
    <h3>検索窓の使い方がよくわかりません</h3>
    <p>
      科目名，教員名，開講コマ，教員名などを入力してください．
      科目名の数字は半角アラビア数字に統一しています
    </p>
    <p>
    例) 集合と位相 月3 理学部
    </p>

    
    <h3>全学共通科目の過去問が見つかりません．どうしたらいいですか？</h3>
    <p>
      もし手に入ったら，送ってください
    </p>
    <h3>専門科目の過去問が見つかりません．どうしたらいいですか？</h3>
    <p>
      法学部専門科目は <a href="https://kyoto0300.sub.jp" target="_blank" class="link-text">法学部学生自治会</a>がたくさん保有しています．問い合わせてみてください<br>
      経済学部の専門科目は，経済学部同窓会が公開しているそうです，経済学部の方に聞いてみてください<br>
      文学部は過去問の文化がないそうなので，おそらく自治会含めて過去問の蓄積はなく見つけるのは厳しいと思われます<br>
      農学部専門科目は <a href="https://kyodaiagri.org" target="_blank" class="link-text">農学部学生自治会</a> に問い合わせると過去問が見つかるかもしれません<br>
      医学部薬学部では毎年それなりにシケタイが活発に動いているようなので，上の学年に聞くと分かるかもしれません．<br>
      工学部の場合，物工は <a href="https://ku1025.netlify.app" target="_blank" class="link-text">KU1025</a>，電電は<a href="https://kuee.netlify.app" target="_blank" class="link-text">KU1025</a>をみてください．
    </p>
    <h3>院試の過去問が見つかりません．どうしたらいいですか？</h3>
    <p>
      京大wikiでは院試の過去問にまで手が回っていないのが現状です．まずは出願先の研究科や専攻のHPを確認してみてください．また研究室の先輩に過去問を持っているか尋ねてみてください
    </p>
  </div>
</template>
<script>
export default {
  title: "回収済みリスト",
  auth: false}
  </script>