<template>
  <div class="scroll-page">
    <h1>シケタイさんへ</h1>
    <div>2020年3月23日作成</div>
    <p>
      シケタイさん<br>
      京大生向けサービス開発者の方<br>
      そのほか京大wikiの活動を応援してくださるみなさまへ
    </p>
    <p>
      いつもありがとうございます．<br>
      京大wikiからみなさまにいくつかお願いがあります．
    </p>

    <h3>過去問提供</h3>
    <p>
      京大wikiはみなさまからの試験問題の提供で成り立っています．<br />
      シケタイの方々はテストのあと，もし可能であればクラスの方たちに過去問提供を呼びかけていただきたいです．
      あるいは，試験対策用に集めた過去問をまとめて投げていただけると大変ありがたいです．<br />
      詳しい方法は <NuxtLink to="upload-exams">こちら</NuxtLink> のリンクよりご確認ください．
    </p>


    <h4>紹介用データ</h4>
    <p>
      リンクは <u>https://kuwiki.net</u><br />
      QRコード画像は <a href="/qr.png">こちら</a><br />
      アイコンPNG画像は <a href="/icon.png"> こちら</a><br>
      アイコンのSVG画像は <a href="/kiwi.svg"> こちら</a><br>
      もしフォントが必要であれば
      <a href="https://fonts.google.com/specimen/Noto+Sans+JP"> こちら </a>
      の Noto Sans JP Regular 300 をご利用ください<br />
    </p>

    <h3>過去問管理</h3>
    <p>
      京大wiikiの運営者は，専門科目の過去問はその学部学科の方が管理するのが望ましいと考えています．<br />
      京大wikiでは現在，全学部の専門科目の過去問を回収していますが，運営者の人員は限られており，他の学部の学生が管理している専門科目もあります．<br />
      もし希望する方がいれば，京大wikiとは独立の団体として過去問を管理していただきたいと考えています．過去問をお渡しする際に併せて，過去問整理用のスクリプトやノウハウもまとめてお渡しする予定です．
      メールアドレスかTwitterのDMまでいつでもご連絡ください．
    </p>
    <p>どうぞよろしくお願いします．</p>
  </div>
</template>
<script>
export default {
  auth: false,
  head: {
    title: "シケタイさんへ"
  },
}
</script>
