<template>
  <div class="scroll-page">
    <h1>プライバシーポリシー</h1>
    <p>
      2021年3月23日作成<br />
      2020年11月1日更新
    </p>

    <h3>個人情報の管理</h3>
    <p>
      当サイトは個人情報の保護に努めて適切に管理し，利用者本人の了承がある場合を除き第三者に開示することはありません。
    </p>

    <h3>個人情報の収集</h3>
    <p>
      当サイトでは利用登録やサイトのご利用によって利用者から自発的に提供されるメールアドレスなどの個人情報を収集します。
      また，利用者が本サイトにアクセスするときの，IPアドレス，デバイスIDなどを特定の情報を受け取り，それらの情報を記録することがあります。
    </p>

    <h3>Cookieについて</h3>
    <p>
      デバイスからログインに利用しているアカウントなど，利用者のデバイスの設定を記憶するために，Cookieやそれと類似の技術を使用します。
    </p>
  </div>
</template>
<script>
export default {
  auth: false,
  head: {
    title: "プライバシーポリシー"
  }
}
</script>
