<template>
  <div class="scroll-page">
    <h1>利用規約</h1>
    <p>
      2020年2月12日作成<br>
      2020年10月1日更新
    </p>
    <p>京大wikiへようこそ！</p>
    <h3>はじめに</h3>
    <p>
      京大wikiをご利用いただきありがとうございます。
      この利用規約は，京大wikiのウェブサイト，またその一部として提供されるコンテンツ，API，その他機能など，すべてのサービス（以下「本サービス」）の利用条件を定めます。
      利用者は本サービスを利用することでこの利用規約を確認し，従うことに同意したこととみなします。
    </p>

    <h3>運営方針</h3>
    <p>
      京大wikiは，学生の立場で学内の資料を共有し代を超えて引き継ぐことを目的として，京大生有志によって非営利に運営されています。（以下「当運営」）
    </p>

    <h3>本サービス</h3>
    <p>
      利用者は，京大wikiのウェブサイトにおいて，蓄積された学内の情報や資料を閲覧できます。<br>
      また，利用者は，それらの情報や資料の蓄積に寄与することができます。<br>
      その他，当運営が提供するツールやAPIを利用することができます。
    </p>

    <h3>利用料金</h3>
    <p>
      本サービスの利用にあたり，費用はかかりません。
    </p>

    <h3>対象者</h3>
    <p>
      本サービスは京都大学の学生向けのものです。
      京都大学の学生であれば正規生及び非正規生に係わりなく誰でも本サービスを利用することができます。
    </p>

    <h3>利用登録</h3>
    <p>
      利用希望者は本規約を確認の上，本サービスへの利用申請およびアカウント作成を行うことができます。
      利用申請には京都大学学生メールのメールアドレスが必要です。
    </p>

    <h3>公開範囲</h3>
    <p>
      ウェブサイト上のコンテンツの閲覧は，学内の学生に制限しています。<br>
      ウェブサイトのソースコードはフロントエンド・バックエンドともにGitHub上で公開しています。<br>
      ウェブサイトのAPIはドキュメントを含めて公開しており，ウェブサイトのアカウントを作成済みであれば，追加の申請なく利用できます。
    </p>

    <h3>アカウントの管理</h3>
    <ol>
      <li>
        利用者は，自己の責任において本サービスで利用するメールアドレスおよびパスワードを適切に管理します。
      </li>
      <li>
        利用者は，本サイトのパスワードに京都大学全学共通ポータルで利用しているパスワードと同一のものを利用しません
      </li>
      <li>
        利用者は，いかなる場合もメールアドレスおよびパスワードを第三者に譲渡または貸与し，もしくは第三者と共用することはできません。当運営はメールアドレスとパスワードの組み合わせが登録情報と一致してログインされた場合には，そのメールアドレスを登録している利用者自身による利用とみなします。
      </li>
      <li>
        メールアドレス及びパスワードが第三者に使用されたことによる損害は，当運営は一切の責任を負わないものとします。
      </li>
    </ol>

    <h3>過去問提供</h3>
    <p>
      過去問を閲覧する方は，試験のあとに試験問題を提供してください。
      回収した過去問は当運営が整理を行い，ウェブサイトにて公開します。
    </p>

    <h3>利用制限および登録抹消</h3>
    <p>
      当運営は，利用者が以下のいずれかに該当する場合には，事前の通知なく，利用者に対して本サービスの全部もしくは一部の利用を制限し，または利用者としての登録を抹消することができるものとします。
    </p>
    <ol>
      <li>本規約のいずれかの条項に違反した場合</li>
      <li>登録事項に虚偽の事実があることが判明した場合</li>
      <li>当運営からの連絡に対し，一定期間返答がない場合</li>
      <li>本サービスの最終の利用から一定期間利用がない場合</li>
      <li>その他，当運営が本サービスの利用を適当でないと判断した場合</li>
    </ol>

    <h3>禁止事項</h3>
    <p>利用者は，本サービスの利用にあたり，以下の行為をしてはなりません。</p>
    <ol>
      <li>本サービスの提供を妨害するおそれのある行為</li>
      <li>
        本サイトに掲載している資料を個人利用を超えて多数ダウンロードする行為
      </li>
      <li>
        利用者自身の所持している京都大学学生用メールアドレス以外によって利用申請をする行為
      </li>
      <li>法令または公序良俗に違反する行為</li>
      <li>他の利用者に関する個人情報等を収集する行為</li>
      <li>
        当運営，ほかの利用者，またはその他第三者のサーバーまたはネットワークの機能を破壊したり，妨害したりする行為
      </li>
      <li>
        本サービスの他の利用者またはその他の第三者に不利益，損害，不快感を与える行為
      </li>
      <li>当運営が許諾しない本サービス上での宣伝行為</li>
      <li>本サービスに掲載された情報を商業的に利用する行為</li>
      <li>その他，当運営が不適切と判断する行為</li>
    </ol>

    <h3>サービス内容の変更・停止</h3>
    <p>
      当運営は，利用者に通知することなく，本サービスの内容を変更しまたは本サービスの提供を停止・中止することができるものとし，これによって利用者に生じた損害について一切の責任を負いません。
    </p>

    <h3>保証の否認および免責事項</h3>
    <ol>
      <li>
        当運営は，本サービスに事実上または法律上の瑕疵（安全性，信頼性，正確性，完全性，有効性，特定の目的への適合性，セキュリティなどに関する欠陥，エラーやバグ，権利侵害などを含みます。）がないことを明示的にも黙示的にも保証しておりません。
      </li>
      <li>
        当運営は，本サービスに起因して利用者に生じたあらゆる損害について一切の責任を負いません。
      </li>
      <li>
        当運営は，本サービスの変更・停止・中止に関して利用者に生じたあらゆる損害について一切の責任を負いません。
      </li>
    </ol>

    <h3>プライバシーポリシー</h3>
    プライバシーポリシーについては
    <a href="/privacy" target="”_blank”">こちら</a>
    をご確認ください

    <h3>利用規約の変更</h3>
    <p>
      当運営は，必要と判断した場合には，事前の利用者への通知なく，いつでも本規約を変更することができるものとします。変更した際はウェブサイトにその旨を掲載します。なお，本規約の変更後，本サービスの利用を開始した場合には，当該利用者は変更後の規約に同意したものとみなします。
    </p>

    <p>以上</p>
  </div>
</template>
<script>
export default {
  auth: false,
  head: {
    title: "利用規約"
  },
}
</script>
<style scoped>
.change-history{
  font-size: 0.8em;
  line-height: 1.8em;
}
  </style>
