<template>
  <v-main>
    <v-container>
      <v-card width="600pt" class="mx-auto termCard">
        <v-card-text class="mx-auto" width="600pt">
          <div class="wrapHINAGATA">
            <h2>利用規約</h2>
            2020年1月9日作成
            <h3>京大wikiへようこそ</h3>
            <h2>はじめに</h2>
            京大wikiのプラットフォーム，またその一部として提供するコンテンツ，サービス，機能（以下「本サービス」）をご利用いただきありがとうございます。<br />
            この利用規約は，京大wikiプロジェクト（以下「本プロジェクト」）の活動で生まれたすべてのサービスの利用条件を定めます。<br />
            利用者は本サービスを利用することで，この利用規約を確認し従うことに同意したこととみなします。

            <h2>本プロジェクト</h2>
            京大wikiとは，学内資料を学生なら誰でも利用可能とし代を超えて引き継いでいこうというプロジェクトです。<br />
            本サービスの一つであるこのウェブサイトはプロジェクトと同様に京大wiki（以下「本ウェブサイト」）と呼ばれています。<br />
            本プロジェクトでは，学生の自治の精神を尊重します。

            <h2>本サービス</h2>
            本サービスでは，京都大学学内の情報や資料を共有できます。<br />
            いつか誰かの役に立つかもしれない情報を提供したり，また役に立つ情報を得たりすることができます。
            また，開発者向けに提供されるAPIを利用したり，本ウェブサイトの具体的な改善案を出すことができたりします。

            <h2>対象者</h2>
            本サービスは京都大学学生向けのものです。<br />
            すべての京都大学の学生が本サービスを利用する権利を有します。<br />

            <h2>公開範囲</h2>
            本プロジェクトによって作成されたソースコードは可能限りすべてオープンソースとします。<br />
            各種コンテンツについては，本ウェブサイトの利用登録時のメールアドレスのドメインを学内メールアドレスのドメインに限定することで利用者をできるだけ学内の学生に限定しています。<br />
            利用者はコンテンツを個人の利用を超えて多数ダウンロードしたり，ダウンロードしたものを第三者に提供したりしてはなりません。
            資料の置かれたURLを提供したい場合は，掲載せず，提供するAPIを利用してください。

            <h2>運営</h2>
            本プロジェクトを主に進行していくチームを京大wiki運営と呼びます。（以下「当運営」）

            <h2>個人情報の取扱い</h2>
            <p>
              当運営は，利用者の承諾なく第三者に流すことを行わず，利用者の個人情報の取扱いには細心の注意を払います。
              当運営は，本プラットフォームへの利用登録や，サービスの利用によって利用者から自発的に提供された情報を収集します。
              利用者がログインしたアカウントをはじめとする，利用者のデバイスの設定を記憶するために，クッキーやそれと同様の技術を使用します。
              当運営は，利用者が本サービスにアクセスするとき，IPアドレス，デバイスID，本サービス内におけるの利用者の活動など特定の情報を受け取り，それらの情報を記録することがあります。
              当運営はより良いサービスを提供することを目的として，収集した情報を他社と共有して総計的に編集，分析する場合があります。
            </p>

            <h2>利用登録</h2>
            <p>
              本ウェブサイトでは，利用希望者が本規約に同意の上，当運営の定める方法で申請して承認を受けることで利用登録を完了します。
              当運営は，登録申請者が京都大学の学生ではないと判断した場合や本規約に違反したことがある者からの申請であると判断した場合，利用登録の申請を承認しないことがあります。
            </p>

            <h2>アカウントの管理</h2>
            <ol>
              <li>
                利用者は，自己の責任において本サービスで利用したメールアドレスおよびパスワードを適切に管理するものとします。
              </li>
              <li>
                利用者は，パスワードに京都大学のと同一のものを利用しません
              </li>
              <li>
                利用者は，いかなる場合にも，メールアドレスおよびパスワードを第三者に譲渡または貸与し，もしくは第三者と共用することはできません。当運営は，メールアドレスとパスワードの組み合わせが登録情報と一致してログインされた場合には，そのメールアドレスを登録している利用者自身による利用とみなします。
              </li>
              <li>
                メールアドレス及びパスワードが第三者によって使用されたことによって生じた損害は，当運営は一切の責任を負わないものとします。
              </li>
            </ol>

            <h2>禁止事項</h2>
            <p>
              利用者は，本サービスの利用にあたり，以下の行為をしてはなりません。
            </p>

            <ol>
              <li>法令または公序良俗に違反する行為</li>
              <li>犯罪行為に関連する行為</li>
              <li>
                当運営，ほかの利用者，またはその他第三者のサーバーまたはネットワークの機能を破壊したり，妨害したりする行為
              </li>
              <li>本サービスによって得られた情報を商業的に利用する行為</li>
              <li>本サービスの提供を妨害するおそれのある行為</li>
              <li>不正アクセスをし，またはこれを試みる行為</li>
              <li>他の利用者に関する個人情報等を収集または蓄積する行為</li>
              <li>
                本サービスの他の利用者またはその他の第三者に不利益，損害，不快感を与える行為
              </li>
              <li>他の利用者，第三者への成りすまし行為</li>
              <li>
                当運営が許諾しない本サービス上での宣伝，広告，勧誘，または営業行為
              </li>
              <li>反社会的勢力に対して直接または間接に利益を供与する行為</li>
              <li>その他，当運営が不適切と判断する行為</li>
            </ol>

            <h2>利用制限および登録抹消</h2>
            当運営は，利用者が以下のいずれかに該当する場合には，事前の通知なく，利用者に対して，本サービスの全部もしくは一部の利用を制限し，または利用者としての登録を抹消することができるものとします。
            <ol>
              <li>本規約のいずれかの条項に違反した場合</li>
              <li>登録事項に虚偽の事実があることが判明した場合</li>
              <li>当運営からの連絡に対し，一定期間返答がない場合</li>
              <li>本サービスについて，最終の利用から一定期間利用がない場合</li>
              <li>
                その他，当運営が本サービスの利用を適当でないと判断した場合
              </li>
            </ol>
            <p>
              当運営は，本条に基づき当運営が行った行為により利用者に生じた損害について，一切の責任を負いません。
            </p>

            <h2>サービス内容の変更等</h2>
            <p>
              当運営は，利用者に通知することなく，本サービスの内容を変更しまたは本サービスの提供を中止することができるものとし，これによって利用者に生じた損害について一切の責任を負いません。
            </p>

            <h2>サービスの提供の停止等</h2>
            <p>
              当運営は，利用者に事前に通知することなく，本サービスの全部または一部の提供を停止または中断することができるものとします。
            </p>

            <h2>保証の否認および免責事項</h2>
            <ol>
              <li>
                当運営は，本サービスに事実上または法律上の瑕疵（安全性，信頼性，正確性，完全性，有効性，特定の目的への適合性，セキュリティなどに関する欠陥，エラーやバグ，権利侵害などを含みます。）がないことを明示的にも黙示的にも保証しておりません。
              </li>
              <li>
                当運営は，本サービスに起因して利用者に生じたあらゆる損害について一切の責任を負いません。
              </li>
              <li>
                等運営は，本サービスの停止に関して利用者に生じたあらゆる損害について一切の責任を負いません。
              </li>
              <li>
                当運営は，本サービスに関して，利用者と他の利用者または第三者との間において生じた取引，連絡または紛争等について一切責任を負いません。
              </li>
            </ol>

            <h2>利用規約の変更</h2>
            <p>
              当運営は，必要と判断した場合には，事前の利用者への通知なく，いつでも本規約を変更することができるものとします。なお，本規約の変更後，本サービスの利用を開始した場合には，当該利用者は変更後の規約に同意したものとみなします。
            </p>

            <h2>通知または連絡</h2>
            <p>
              利用者と当運営との間の通知または連絡は，当運営の定める方法によって行うものとします。当運営は別途定める方式に従った変更届け出が利用者から行われない限り，現在登録されている連絡先が有効なものとみなして当該連絡先へ通知または連絡を行い，これらは発信時に利用者へ到達したものとみなします。
            </p>

            <h2>権利義務の譲渡の禁止</h2>
            <p>
              利用者は，利用契約上の地位または本規約に基づく権利もしくは義務を第三者に譲渡し，または担保に供することはできません。
            </p>
            <p>以上</p>
          </div>
        </v-card-text>
      </v-card>
    </v-container>
  </v-main>
</template>
<style scope>
.termCard {
  margin: 10pt;
  padding: 30pt;
}

h1 {
  margin: 20pt 0pt 10pt;
}

h2 {
  margin: 20pt 0pt 10pt;
}
</style>
