<template>
  <v-main>
    <v-container>
      <v-card width="600pt" class="mx-auto termCard">
        <v-card-text class="mx-auto" width="600pt">
          <div class="wrapHINAGATA">
            <h2>利用規約</h2>
            <p class="zenbun">
              この利用規約は，京大wikiの一連の活動によって作成されたすべてのサービスの利用条件を定めます。<br />
              利用者は本サービスを利用することで，本利用規約を確認し従うことに同意したこととみなします。
            </p>

            <h2>公開事項</h2>
            本サービスに関わるソースコードは可能な範囲で全て公開します。またその公開したソースコードにはMITライセンスにしたがいます。

            <h2>本サービス対象者</h2>
            本サービスは京都大学学生向けのものです。<br />
            ウェブサイトに関しては，利用登録時のメールアドレスのドメインを学内メールアドレスのドメインに限定することで，利用者を可能な限り学内の学生に限定しています。

            <h2>利用登録</h2>
            <ol>
              <li>
                本ウェブサイトでは，登録希望者が本規約に同意の上，京大wikiの運営者（以下，当運営）の定める方法によって利用登録を申請し，当運営がこれを承認することで，利用登録が完了するものとします。
              </li>
              <li>
                当運営は，利用登録の申請者に以下の事由があると判断した場合，利用登録の申請を承認しないことがあります。
                <ol>
                  <li>京都大学学生ではないと判断した場合</li>
                  <li>本規約に違反したことがある者からの申請である場合</li>
                  <li>その他，当運営が利用登録を相当でないと判断した場合</li>
                </ol>
              </li>
            </ol>

            <h2>メールアドレスおよびパスワードの管理</h2>
            <ol>
              <li>
                利用者は，自己の責任において，本サービスで利用したメールアドレスおよびパスワードを適切に管理するものとします。
              </li>
              <li>利用者は，パスワードを京都大学と同一のものを利用しません</li>
              <li>
                利用者は，いかなる場合にも，メールアドレスおよびパスワードを第三者に譲渡または貸与し，もしくは第三者と共用することはできません。当運営は，メールアドレスとパスワードの組み合わせが登録情報と一致してログインされた場合には，そのメールアドレスを登録している利用者自身による利用とみなします。
              </li>
              <li>
                メールアドレス及びパスワードが第三者によって使用されたことによって生じた損害は，当運営は一切の責任を負わないものとします。
              </li>
            </ol>

            <h2>禁止事項</h2>
            <p>
              利用者は，本サービスの利用にあたり，以下の行為をしてはなりません。
            </p>

            <ol>
              <li>法令または公序良俗に違反する行為</li>
              <li>犯罪行為に関連する行為</li>
              <li>
                本サービスに含まれる著作権，商標権ほか知的財産権を侵害する行為
              </li>
              <li>
                当運営，ほかの利用者，またはその他第三者のサーバーまたはネットワークの機能を破壊したり，妨害したりする行為
              </li>
              <li>本サービスによって得られた情報を商業的に利用する行為</li>
              <li>本サービスの提供する資料を多量にダウンロードする行為</li>
              <li>
                当運営への許諾なく，資料の置かれたURLを多数収集しネット上に掲載する行為
              </li>
              <li>本サービスの運営を妨害するおそれのある行為</li>
              <li>不正アクセスをし，またはこれを試みる行為</li>
              <li>他の利用者に関する個人情報等を収集または蓄積する行為</li>
              <li>不正な目的を持って本サービスを利用する行為</li>
              <li>
                本サービスの他の利用者またはその他の第三者に不利益，損害，不快感を与える行為
              </li>
              <li>他の利用者に成りすます行為</li>
              <li>
                当運営が許諾しない本サービス上での宣伝，広告，勧誘，または営業行為
              </li>
              <li>
                当運営のサービスに関連して，反社会的勢力に対して直接または間接に利益を供与する行為
              </li>
              <li>その他，当運営が不適切と判断する行為</li>
            </ol>

            <h2>本サービスの提供の停止等</h2>
            <ol>
              <li>
                当運営は，以下のいずれかの事由があると判断した場合，利用者に事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。
                <ol>
                  <li>
                    本サービスにかかるコンピュータシステムの保守点検または更新を行う場合
                  </li>
                  <li>
                    地震，落雷，火災，停電または天災などの不可抗力により，本サービスの提供が困難となった場合
                  </li>
                  <li>コンピュータまたは通信回線等が事故により停止した場合</li>
                  <li>その他，当運営が本サービスの提供が困難と判断した場合</li>
                </ol>
              </li>
              <li>
                当運営は，本サービスの提供の停止または中断により，利用者または第三者が被ったいかなる不利益または損害についても，一切の責任を負わないものとします。
              </li>
            </ol>

            <h2>利用制限および登録抹消</h2>
            <ol>
              <li>
                当運営は，利用者が以下のいずれかに該当する場合には，事前の通知なく，利用者に対して，本サービスの全部もしくは一部の利用を制限し，または利用者としての登録を抹消することができるものとします。
                <ol>
                  <li>本規約のいずれかの条項に違反した場合</li>
                  <li>登録事項に虚偽の事実があることが判明した場合</li>
                  <li>当運営からの連絡に対し，一定期間返答がない場合</li>
                  <li>
                    本サービスについて，最終の利用から一定期間利用がない場合
                  </li>
                  <li>
                    その他，当運営が本サービスの利用を適当でないと判断した場合
                  </li>
                </ol>
              </li>
              <li>
                当運営は，本条に基づき当運営が行った行為により利用者に生じた損害について，一切の責任を負いません。
              </li>
            </ol>

            <h2>保証の否認および免責事項</h2>
            <ol>
              <li>
                当運営は，本サービスに事実上または法律上の瑕疵（安全性，信頼性，正確性，完全性，有効性，特定の目的への適合性，セキュリティなどに関する欠陥，エラーやバグ，権利侵害などを含みます。）がないことを明示的にも黙示的にも保証しておりません。
              </li>
              <li>
                当運営は，本サービスに起因して利用者に生じたあらゆる損害について一切の責任を負いません。
              </li>
              <li>
                当運営は，本サービスに関して，利用者と他の利用者または第三者との間において生じた取引，連絡または紛争等について一切責任を負いません。
              </li>
            </ol>

            <h2>サービス内容の変更等</h2>
            <p>
              当運営は，利用者に通知することなく，本サービスの内容を変更しまたは本サービスの提供を中止することができるものとし，これによって利用者に生じた損害について一切の責任を負いません。
            </p>

            <h2>利用規約の変更</h2>
            <p>
              当運営は，必要と判断した場合には，利用者に通知することなくいつでも本規約を変更することができるものとします。なお，本規約の変更後，本サービスの利用を開始した場合には，当該利用者は変更後の規約に同意したものとみなします。
            </p>

            <h2>個人情報の取扱い</h2>
            <p>
              当運営は，本サービスの利用登録や利用によって自発的に提供された情報を収集します。
              利用者がログインしたアカウントをはじめとする利用者のローカルコンピューターの設定を記憶するために，クッキーや同様の技術を使用します。
              利用者が本サービスにアクセスする際、当運営は、IPアドレス、デバイスID、本サービス内におけるお客様の活動など、特定の情報を受け取り，それらの情報を記録することがあります。
              当運営は、より良いサービスを提供することを目的として、収集した情報を他社と共有して総計的に編集、分析する場合があります。
            </p>

            <h2>通知または連絡</h2>
            <p>
              利用者と当運営との間の通知または連絡は，当運営の定める方法によって行うものとします。当運営は利用者から当運営が別途定める方式に従った変更届け出がない限り，現在登録されている連絡先が有効なものとみなして当該連絡先へ通知または連絡を行い，これらは発信時に利用者へ到達したものとみなします。
            </p>

            <h2>権利義務の譲渡の禁止</h2>
            <p>
              利用者は，当運営の書面による事前の承諾なく，利用契約上の地位または本規約に基づく権利もしくは義務を第三者に譲渡し，または担保に供することはできません。
            </p>

            <h2>準拠法・裁判管轄</h2>
            <ol>
              <li>本規約の解釈にあたっては，日本法を準拠法とします。</li>
              <li>
                本サービスに関して紛争が生じた場合には，京都市左京区吉田本町を管轄する裁判所を専属的合意管轄とします。
              </li>
            </ol>
            <p>以上</p>
          </div>
        </v-card-text>
      </v-card>
    </v-container>
  </v-main>
</template>
<style scope>
.termCard {
  margin: 10pt;
  padding: 30pt;
}

p.zenbun {
  margin: 0pt 0pt 20pt;
}

h1 {
  margin: 20pt 0pt 10pt;
}

h2 {
  margin: 20pt 0pt 10pt;
}
</style>
