<template>
  <div>
    <v-card-title>シケタイさんへ</v-card-title>
    <v-card-subtitle>2020年3月23日作成</v-card-subtitle>
    <v-card-subtitle>
      シケタイさん<br>
      各学部過去問整理担当者さん<br>
      京大生向けサービス開発者さん<br>
      そのほか京大wikiの活動を陰ながら応援してくださるみなさまへ
    </v-card-subtitle>
    <v-card-text>
      いつもありがとうございます．<br>
      京大wikiからみなさまにいくつかお願いがあります．

      <h3>過去問提供</h3>
      京大wikiはみなさんからの試験問題の提供で成り立っています．
      シケタイの方々は，もしよければクラスの方たちから過去問を収集し京大wikiまでまとめて提供していただきたいです．<br />
      あるいは試験対策用に集めた過去問をまとめて投げていただけると嬉しいです．
      詳しい方法は<a href="volunteer">こちら</a>のリンクよりご確認ください．

      <h3>京大wikiの紹介</h3>
      京大wikiは全学共通科目や専門科目の過去問を多数揃えていますので，ぜひ期末試験対策にご紹介ください．<br />
      京大wikiが全学に対して広報できる手段は少なく，学生間の口コミを頼りにしているのが現状です．<br />
      SNSなどで紹介するにあたってご連絡は必要ありませんが，パンフレットなどに掲載するときは，事後報告で構いませんのでご連絡いただけると幸いです．<br />

      <h4>紹介用資料</h4>
      京大wikiのリンクは <u>https://kuwiki.net</u><br />
      QRコードは<a href="/qr.png">こちら</a><br />
      キウイのpng画像は<a href="/icon.png"> こちら</a></br>
      キウイのsvg画像は<a href="/kiwi.svg"> こちら</a></br>
      フォントが必要であれば
      <a href="https://fonts.google.com/specimen/Noto+Sans+JP"> こちら </a>
      よりNoto Sans JPのRegular400をダウンロードしてご利用ください<br />

      <h3>過去問管理</h3>
      専門科目の過去問は，その学部学科の方が管理するのが望ましいと考えています．<br />
      京大wikiでは全学部の専門科目の過去問を回収していますが，運営者の人員は限られており，他の学部の学生が管理している専門科目もあります．<br />
      もし希望者する方がいれば，京大wikiや楽単botなどwebサービスとの連携のためGoogle Driveのフォルダは共有しつつも，京大wikiとは独立の団体として過去問を管理していただきたいと考えています．
      過去問と併せて，過去問整理用のスクリプトやノウハウなどもまとめてお渡しします．<br>
      メールアドレスかTwitterのDMまでいつでもご連絡ください．

      <h3>関連リンクについて</h3>
      関連リンクにHPを掲載したい方はご連絡ください．<br>
    </v-card-text>
  </div>
</template>
